#+TITLE: INPUT
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: CSC 109 - Introduction to programming in Python - Fall 2023
#+STARTUP: overview hideblocks indent inlineimages
#+PROPERTY: header-args:python :results output :exports both :session *Python*
* A few open questions

- What does the expression ~str(int(age) + 1)~ do?
  1) ~age~ is string ~input~
  2) ~int(age)~ converts the string to a number - you cannot do that
     with any character like "a": ~int("a")~ throws an error. To convert
     characters to their Unicode standard, you need to use ~ord~:
     #+begin_src python
       print(int("25"))
       print(ord("a"))
       print(ord("A"))
     #+end_src
  3) ~int(age) + 1~ adds 1 to whatever number ~int(age)~ evaluates to:
     #+begin_src python
       age = "25"
       print(age)
       print(age + " years old")
       print(int(age))
       print(int(age)+1)
     #+end_src

     #+RESULTS:
     : 25
     : 25 years old
     : 25
     : 26
  4) ~str(int(age) + 1)~ converts the result to a string:
     #+begin_src python
       age = "25"
       print(age)
       print(age + " years old")
       print(int(age))
       print(int(age)+1)
       print(str(int(age)+1))
       print(str(int(age)+1) + " years old")
     #+end_src

     #+RESULTS:
     : 25
     : 25 years old
     : 25
     : 26
     : 26
     : 26 years old

- [[https://automatetheboringstuff.com/eval/3-4.html][Here is an HTML animation to illustrate these steps]] (Sweigart, 2023)

- ~split(self, / , sep=None, maxsplit=-1)~ is a /string method/ with two
  optional (defaulted) arguments - it returns list of words in the
  string using ~sep~ as the delimiter, at most ~maxsplit~ splits are done:
  elements (note the implicit arguments):
  #+begin_src python
    print('1,2,3'.split(','))  # default maxsplit = -1 means no limit
    print('1,2,3'.split(',',0)) # don't split
    print('1,2,3'.split(',',1)) # split once
    print('1,2,3'.split(',',2)) # split twice
    print('1,2,3'.split(',',3)) # split thrice - nothing more to do
  #+end_src

- The dot-operator ~.~ is an /accessor/: it allows you to access anything
  that's stored inside an object, e.g. the /string/ class ~str~, or an
  instance of that class, a particular string.

- What happens when the string to be split does not have substrings?
  #+begin_src python :results output
    a,b = 'Marcus'.split()
    print(a,b)
  #+end_src

  #+RESULTS:

- Why?
  #+begin_src python :results output
    help(str.split)
  #+end_src

  #+RESULTS:
  #+begin_example
  Help on method_descriptor:

  split(self, /, sep=None, maxsplit=-1)
      Return a list of the substrings in the string, using sep as the separator string.

        sep
          The separator used to split the string.

          When set to None (the default value), will split on any whitespace
          character (including \\n \\r \\t \\f and spaces) and will discard
          empty strings from the result.
        maxsplit
          Maximum number of splits (starting from the left).
          -1 (the default value) means no limit.

      Note, str.split() is mainly useful for data that has been intentionally
      delimited.  With natural text that includes punctuation, consider using
      the regular expression module.
  #+end_example

- What does the ~/~ refer to in the ~str.split~ docstring:
  #+begin_example
    str.split(self, /, sep=None, maxsplit=-1)
  #+end_example
  The ~/~ is a /parameter separator/: it denotes the end of
  positional-only parameters. After ~self~ (the string itself), the
  parameters ~sep~ and ~maxsplit~ can be explicitly assigned:
  #+begin_src python :results output
    print(str.split('Marcus Birkenkrahe'))
    print(str.split('Marcus_Birkenkrahe','_'))
    print(str.split('Marcus_Birkenkrahe',sep='_'))
    print('Marcus_Birkenkrahe'.split(sep='_'))
    print('Marcus_Birkenkrahe'.split('_'))
  #+end_src

  #+RESULTS:
  : ['Marcus', 'Birkenkrahe']
  : ['Marcus', 'Birkenkrahe']
  : ['Marcus', 'Birkenkrahe']
  : ['Marcus', 'Birkenkrahe']
  : ['Marcus', 'Birkenkrahe']

